suyashjunnarkar/self_balancing/firmware/epcf_project/pcf/include/private/arch/arm/cm3/nxp/lpc1768/lpc1768_regmap.h
/**
 * \file		lpc1768_regmap.h
 * \brief		Describe the Register Map of LPC1768.
 * \copyright 	Copyright (c) 2014 <br> PhiRobotics Research Pvt Ltd.
 * 
 * \par			For licensing information, see the file 'LICENSE' in the root folder of	this software module.
 *
 * Review status: NO
 *
 */
#ifndef __PCF_INCLUDE_PRIVATE_ARCH_ARM_CM3_NXP_LPC1768_LPC1768_REGMAP_H
#define __PCF_INCLUDE_PRIVATE_ARCH_ARM_CM3_NXP_LPC1768_LPC1768_REGMAP_H

/**
 * \ingroup native
 * \defgroup LPCxx Peripherals
 * @{
 * 	
 * 	\brief  LPC1768 Reg Map
 */

 /** Macros defined for defining register read/write access                                          */
#define _RW                 volatile
#define _R                  volatile const
#define _W                  volatile

 
/** \brief IRQ interrupt source definition */
typedef enum
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
  Reset_IRQn                    = -15,      /**< 1 Reset Vector, invoked on PowerUp and warm reset*/
  NonMaskableInt_IRQn           = -14,      /**< 2 Non Maskable Interrupt                         */
  HardFault_IRQn                = -13,      /**< 3  Hard Fault, all classes of Fault              */
  MemoryManagement_IRQn         = -12,      /**< 4 Cortex-M3 Memory Management Interrupt          */
  BusFault_IRQn                 = -11,      /**< 5 Cortex-M3 Bus Fault Interrupt                  */
  UsageFault_IRQn               = -10,      /**< 6 Cortex-M3 Usage Fault Interrupt                */
  SVCall_IRQn                   = -5,       /**< 11 Cortex-M3 SV Call Interrupt                   */
  DebugMonitor_IRQn             = -4,       /**< 12 Cortex-M3 Debug Monitor Interrupt             */
  PendSV_IRQn                   = -2,       /**< 14 Cortex-M3 Pend SV Interrupt                   */
  SysTick_IRQn                  = -1,       /**< 15 Cortex-M3 System Tick Interrupt               */

/******  LPC17xx Specific Interrupt Numbers *******************************************************/
  WDT_IRQn                      = 0,        /**< Watchdog Timer Interrupt                         */
  TIMER0_IRQn                   = 1,        /**< Timer0 Interrupt                                 */
  TIMER1_IRQn                   = 2,        /**< Timer1 Interrupt                                 */
  TIMER2_IRQn                   = 3,        /**< Timer2 Interrupt                                 */
  TIMER3_IRQn                   = 4,        /**< Timer3 Interrupt                                 */
  UART0_IRQn                    = 5,        /**< UART0 Interrupt                                  */
  UART1_IRQn                    = 6,        /**< UART1 Interrupt                                  */
  UART2_IRQn                    = 7,        /**< UART2 Interrupt                                  */
  UART3_IRQn                    = 8,        /**< UART3 Interrupt                                  */
  PWM1_IRQn                     = 9,        /**< PWM1 Interrupt                                   */
  I2C0_IRQn                     = 10,       /**< I2C0 Interrupt                                   */
  I2C1_IRQn                     = 11,       /**< I2C1 Interrupt                                   */
  I2C2_IRQn                     = 12,       /**< I2C2 Interrupt                                   */
  SPI_IRQn                      = 13,       /**< SPI Interrupt                                    */
  SSP0_IRQn                     = 14,       /**< SSP0 Interrupt                                   */
  SSP1_IRQn                     = 15,       /**< SSP1 Interrupt                                   */
  PLL0_IRQn                     = 16,       /**< PLL0 Lock (Main PLL) Interrupt                   */
  RTC_IRQn                      = 17,       /**< Real Time Clock Interrupt                        */
  EINT0_IRQn                    = 18,       /**< External Interrupt 0 Interrupt                   */
  EINT1_IRQn                    = 19,       /**< External Interrupt 1 Interrupt                   */
  EINT2_IRQn                    = 20,       /**< External Interrupt 2 Interrupt                   */
  EINT3_IRQn                    = 21,       /**< External Interrupt 3 Interrupt                   */
  ADC_IRQn                      = 22,       /**< A/D Converter Interrupt                          */
  BOD_IRQn                      = 23,       /**< Brown-Out Detect Interrupt                       */
  USB_IRQn                      = 24,       /**< USB Interrupt                                    */
  CAN_IRQn                      = 25,       /**< CAN Interrupt                                    */
  DMA_IRQn                      = 26,       /**< General Purpose DMA Interrupt                    */
  I2S_IRQn                      = 27,       /**< I2S Interrupt                                    */
  ENET_IRQn                     = 28,       /**< Ethernet Interrupt                               */
  RIT_IRQn                      = 29,       /**< Repetitive Interrupt Timer Interrupt             */
  MCPWM_IRQn                    = 30,       /**< Motor Control PWM Interrupt                      */
  QEI_IRQn                      = 31,       /**< Quadrature Encoder Interface Interrupt           */
  PLL1_IRQn                     = 32,       /**< PLL1 Lock (USB PLL) Interrupt                    */
  USBActivity_IRQn              = 33,       /**< USB Activity Interrupt 						  */
  CANActivity_IRQn              = 34,       /**< CAN Activity Interrupt 						  */
} IRQn_Type;

/**		\brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC).	*/
typedef struct
{
  _RW uint32_t ISER[8];                 /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register           */
       uint32_t RESERVED0[24];
  _RW uint32_t ICER[8];                 /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register         */
       uint32_t RSERVED1[24];
  _RW uint32_t ISPR[8];                 /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register          */
       uint32_t RESERVED2[24];
  _RW uint32_t ICPR[8];                 /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register        */
       uint32_t RESERVED3[24];
  _RW uint32_t IABR[8];                 /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register           */
       uint32_t RESERVED4[56];
  _RW uint8_t  IP[240];                 /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) */
       uint32_t RESERVED5[644];
  _W  uint32_t STIR;                    /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register     */
}  NVIC_Type;

/**	\brief  Structure type to access the System Control Block (SCB).	*/
typedef struct
{
  _R  uint32_t CPUID;                   /*!< Offset: 0x000 (R/ )  CPU ID Base Register                                  */
  _RW uint32_t ICSR;                    /*!< Offset: 0x004 (R/W)  Interrupt Control State Register                      */
  _RW uint32_t VTOR;                    /*!< Offset: 0x008 (R/W)  Vector Table Offset Register                          */
  _RW uint32_t AIRCR;                   /*!< Offset: 0x00C (R/W)  Application Interrupt / Reset Control Register        */
  _RW uint32_t SCR;                     /*!< Offset: 0x010 (R/W)  System Control Register                               */
  _RW uint32_t CCR;                     /*!< Offset: 0x014 (R/W)  Configuration Control Register                        */
  _RW uint8_t  SHP[12];                 /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
  _RW uint32_t SHCSR;                   /*!< Offset: 0x024 (R/W)  System Handler Control and State Register             */
  _RW uint32_t CFSR;                    /*!< Offset: 0x028 (R/W)  Configurable Fault Status Register                    */
  _RW uint32_t HFSR;                    /*!< Offset: 0x02C (R/W)  Hard Fault Status Register                            */
  _RW uint32_t DFSR;                    /*!< Offset: 0x030 (R/W)  Debug Fault Status Register                           */
  _RW uint32_t MMFAR;                   /*!< Offset: 0x034 (R/W)  Mem Manage Address Register                           */
  _RW uint32_t BFAR;                    /*!< Offset: 0x038 (R/W)  Bus Fault Address Register                            */
  _RW uint32_t AFSR;                    /*!< Offset: 0x03C (R/W)  Auxiliary Fault Status Register                       */
  _R  uint32_t PFR[2];                  /*!< Offset: 0x040 (R/ )  Processor Feature Register                            */
  _R  uint32_t DFR;                     /*!< Offset: 0x048 (R/ )  Debug Feature Register                                */
  _R  uint32_t ADR;                     /*!< Offset: 0x04C (R/ )  Auxiliary Feature Register                            */
  _R  uint32_t MMFR[4];                 /*!< Offset: 0x050 (R/ )  Memory Model Feature Register                         */
  _R  uint32_t ISAR[5];                 /*!< Offset: 0x060 (R/ )  ISA Feature Register                                  */
} SCB_Type;

/** \brief  Structure type to access the System Timer (SysTick).	*/
typedef struct
{
  _RW uint32_t CTRL;                    /*!< Offset: 0x000 (R/W)  SysTick Control and Status Register */
  _RW uint32_t LOAD;                    /*!< Offset: 0x004 (R/W)  SysTick Reload Value Register       */
  _RW uint32_t VAL;                     /*!< Offset: 0x008 (R/W)  SysTick Current Value Register      */
  _R  uint32_t CALIB;                   /*!< Offset: 0x00C (R/ )  SysTick Calibration Register        */
} SysTick_Type;

