suyashjunnarkar/self_balancing/firmware/epcf_project/pcf/include/private/arch/arm/cm3/nxp/lpc1768/lpc1768_regmap.h
/** \brief  Structure type to access the Instrumentation Trace Macrocell Register (ITM). */
typedef struct
{
  _W  union
  {
    _W  uint8_t    u8;                  /*!< Offset: 0x000 ( /W)  ITM Stimulus Port 8-bit                   */
    _W  uint16_t   u16;                 /*!< Offset: 0x000 ( /W)  ITM Stimulus Port 16-bit                  */
    _W  uint32_t   u32;                 /*!< Offset: 0x000 ( /W)  ITM Stimulus Port 32-bit                  */
  }  PORT [32];                          /*!< Offset: 0x000 ( /W)  ITM Stimulus Port Registers               */
       uint32_t RESERVED0[864];
  _RW uint32_t TER;                     /*!< Offset:       (R/W)  ITM Trace Enable Register                 */
       uint32_t RESERVED1[15];
  _RW uint32_t TPR;                     /*!< Offset:       (R/W)  ITM Trace Privilege Register              */
       uint32_t RESERVED2[15];
  _RW uint32_t TCR;                     /*!< Offset:       (R/W)  ITM Trace Control Register                */
       uint32_t RESERVED3[29];
  _RW uint32_t IWR;                     /*!< Offset:       (R/W)  ITM Integration Write Register            */
  _RW uint32_t IRR;                     /*!< Offset:       (R/W)  ITM Integration Read Register             */
  _RW uint32_t IMCR;                    /*!< Offset:       (R/W)  ITM Integration Mode Control Register     */
       uint32_t RESERVED4[43];
  _RW uint32_t LAR;                     /*!< Offset:       (R/W)  ITM Lock Access Register                  */
  _RW uint32_t LSR;                     /*!< Offset:       (R/W)  ITM Lock Status Register                  */
       uint32_t RESERVED5[6];
  _R  uint32_t PID4;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #4 */
  _R  uint32_t PID5;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #5 */
  _R  uint32_t PID6;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #6 */
  _R  uint32_t PID7;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #7 */
  _R  uint32_t PID0;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #0 */
  _R  uint32_t PID1;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #1 */
  _R  uint32_t PID2;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #2 */
  _R  uint32_t PID3;                    /*!< Offset:       (R/ )  ITM Peripheral Identification Register #3 */
  _R  uint32_t CID0;                    /*!< Offset:       (R/ )  ITM Component  Identification Register #0 */
  _R  uint32_t CID1;                    /*!< Offset:       (R/ )  ITM Component  Identification Register #1 */
  _R  uint32_t CID2;                    /*!< Offset:       (R/ )  ITM Component  Identification Register #2 */
  _R  uint32_t CID3;                    /*!< Offset:       (R/ )  ITM Component  Identification Register #3 */
} ITM_Type;


/**	\brief  Structure type to access the Interrupt Type Register.	*/
typedef struct
{
       uint32_t RESERVED0;
  _R  uint32_t ICTR;                    /*!< Offset: 0x004 (R/ )  Interrupt Control Type Register */
#if ((defined __CM3_REV) && (__CM3_REV >= 0x200))
  _RW uint32_t ACTLR;                   /*!< Offset: 0x008 (R/W)  Auxiliary Control Register      */
#else
       uint32_t RESERVED1;
#endif
} InterruptType_Type;


/**	\brief  Structure type to access the Memory Protection Unit (MPU).	*/
typedef struct
{
  _R  uint32_t TYPE;                    /*!< Offset: 0x000 (R/ )  MPU Type Register                              */
  _RW uint32_t CTRL;                    /*!< Offset: 0x004 (R/W)  MPU Control Register                           */
  _RW uint32_t RNR;                     /*!< Offset: 0x008 (R/W)  MPU Region RNRber Register                     */
  _RW uint32_t RBAR;                    /*!< Offset: 0x00C (R/W)  MPU Region Base Address Register               */
  _RW uint32_t RASR;                    /*!< Offset: 0x010 (R/W)  MPU Region Attribute and Size Register         */
  _RW uint32_t RBAR_A1;                 /*!< Offset: 0x014 (R/W)  MPU Alias 1 Region Base Address Register       */
  _RW uint32_t RASR_A1;                 /*!< Offset: 0x018 (R/W)  MPU Alias 1 Region Attribute and Size Register */
  _RW uint32_t RBAR_A2;                 /*!< Offset: 0x01C (R/W)  MPU Alias 2 Region Base Address Register       */
  _RW uint32_t RASR_A2;                 /*!< Offset: 0x020 (R/W)  MPU Alias 2 Region Attribute and Size Register */
  _RW uint32_t RBAR_A3;                 /*!< Offset: 0x024 (R/W)  MPU Alias 3 Region Base Address Register       */
  _RW uint32_t RASR_A3;                 /*!< Offset: 0x028 (R/W)  MPU Alias 3 Region Attribute and Size Register */
} MPU_Type;


/**	\brief  Structure type to access the Core Debug Register (CoreDebug).	*/
typedef struct
{
  _RW uint32_t DHCSR;                   /*!< Offset: 0x000 (R/W)  Debug Halting Control and Status Register    */
  _W  uint32_t DCRSR;                   /*!< Offset: 0x004 ( /W)  Debug Core Register Selector Register        */
  _RW uint32_t DCRDR;                   /*!< Offset: 0x008 (R/W)  Debug Core Register Data Register            */
  _RW uint32_t DEMCR;                   /*!< Offset: 0x00C (R/W)  Debug Exception and Monitor Control Register */
} CoreDebug_Type;

// includeing the core reg map Address Macro
#include "../../../../arm/cm3/nxp/lpc1768/lpc1768_cm3.h"       /* Cortex-M3 processor and core peripherals           */

/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

/*------------- System Control (SC) ------------------------------------------*/
/** \brief System Control (SC) register structure definition */
typedef struct
{
  _RW uint32_t FLASHCFG;               /* Flash Accelerator Module           */
       uint32_t RESERVED0[31];
  _RW uint32_t PLL0CON;                /* Clocking and Power Control         */
  _RW uint32_t PLL0CFG;
  _R  uint32_t PLL0STAT;
  _W  uint32_t PLL0FEED;
       uint32_t RESERVED1[4];
  _RW uint32_t PLL1CON;
  _RW uint32_t PLL1CFG;
  _R  uint32_t PLL1STAT;
  _W  uint32_t PLL1FEED;
       uint32_t RESERVED2[4];
  _RW uint32_t PCON;
  _RW uint32_t PCONP;
       uint32_t RESERVED3[15];
  _RW uint32_t CCLKCFG;
  _RW uint32_t USBCLKCFG;
  _RW uint32_t CLKSRCSEL;
  _RW uint32_t	CANSLEEPCLR;
  _RW uint32_t	CANWAKEFLAGS;
       uint32_t RESERVED4[10];
  _RW uint32_t EXTINT;                 /* External Interrupts                */
       uint32_t RESERVED5;
  _RW uint32_t EXTMODE;
  _RW uint32_t EXTPOLAR;
       uint32_t RESERVED6[12];
  _RW uint32_t RSID;                   /* Reset                              */
       uint32_t RESERVED7[7];
  _RW uint32_t SCS;                    /* Syscon Miscellaneous Registers     */
  _RW uint32_t IRCTRIM;                /* Clock Dividers                     */
  _RW uint32_t PCLKSEL0;
  _RW uint32_t PCLKSEL1;
       uint32_t RESERVED8[4];
  _RW uint32_t USBIntSt;               /* USB Device/OTG Interrupt Register  */
  _RW uint32_t DMAREQSEL;
  _RW uint32_t CLKOUTCFG;              /* Clock Output Configuration         */
 } SC_TypeDef;

