suyashjunnarkar/self_balancing/firmware/epcf_project/pcf/include/private/arch/arm/cm3/nxp/lpc1768/lpc1768_regmap.h
/*------------- Pin Connect Block (PINCON) -----------------------------------*/
/** \brief Pin Connect Block (PINCON) register structure definition */
typedef struct
{
  _RW uint32_t PINSEL0;
  _RW uint32_t PINSEL1;
  _RW uint32_t PINSEL2;
  _RW uint32_t PINSEL3;
  _RW uint32_t PINSEL4;
  _RW uint32_t PINSEL5;
  _RW uint32_t PINSEL6;
  _RW uint32_t PINSEL7;
  _RW uint32_t PINSEL8;
  _RW uint32_t PINSEL9;
  _RW uint32_t PINSEL10;
       uint32_t RESERVED0[5];
  _RW uint32_t PINMODE0;
  _RW uint32_t PINMODE1;
  _RW uint32_t PINMODE2;
  _RW uint32_t PINMODE3;
  _RW uint32_t PINMODE4;
  _RW uint32_t PINMODE5;
  _RW uint32_t PINMODE6;
  _RW uint32_t PINMODE7;
  _RW uint32_t PINMODE8;
  _RW uint32_t PINMODE9;
  _RW uint32_t PINMODE_OD0;
  _RW uint32_t PINMODE_OD1;
  _RW uint32_t PINMODE_OD2;
  _RW uint32_t PINMODE_OD3;
  _RW uint32_t PINMODE_OD4;
  _RW uint32_t I2CPADCFG;
} PINCON_TypeDef;

/*------------- General Purpose Input/Output (GPIO) --------------------------*/
/** \brief General Purpose Input/Output (GPIO) register structure definition */
typedef struct
{
  union {
    _RW uint32_t FIODIR;
    struct {
      _RW uint16_t FIODIRL;
      _RW uint16_t FIODIRH;
    };
    struct {
      _RW uint8_t  FIODIR0;
      _RW uint8_t  FIODIR1;
      _RW uint8_t  FIODIR2;
      _RW uint8_t  FIODIR3;
    };
  };
  uint32_t RESERVED0[3];
  union {
    _RW uint32_t FIOMASK;
    struct {
      _RW uint16_t FIOMASKL;
      _RW uint16_t FIOMASKH;
    };
    struct {
      _RW uint8_t  FIOMASK0;
      _RW uint8_t  FIOMASK1;
      _RW uint8_t  FIOMASK2;
      _RW uint8_t  FIOMASK3;
    };
  };
  union {
    _RW uint32_t FIOPIN;
    struct {
      _RW uint16_t FIOPINL;
      _RW uint16_t FIOPINH;
    };
    struct {
      _RW uint8_t  FIOPIN0;
      _RW uint8_t  FIOPIN1;
      _RW uint8_t  FIOPIN2;
      _RW uint8_t  FIOPIN3;
    };
  };
  union {
    _RW uint32_t FIOSET;
    struct {
      _RW uint16_t FIOSETL;
      _RW uint16_t FIOSETH;
    };
    struct {
      _RW uint8_t  FIOSET0;
      _RW uint8_t  FIOSET1;
      _RW uint8_t  FIOSET2;
      _RW uint8_t  FIOSET3;
    };
  };
  union {
    _W  uint32_t FIOCLR;
    struct {
      _W  uint16_t FIOCLRL;
      _W  uint16_t FIOCLRH;
    };
    struct {
      _W  uint8_t  FIOCLR0;
      _W  uint8_t  FIOCLR1;
      _W  uint8_t  FIOCLR2;
      _W  uint8_t  FIOCLR3;
    };
  };
} GPIO_TypeDef;

/** \brief General Purpose Input/Output interrupt (GPIOINT) register structure definition */
typedef struct
{
  _R  uint32_t IntStatus;
  _R  uint32_t IO0IntStatR;
  _R  uint32_t IO0IntStatF;
  _W  uint32_t IO0IntClr;
  _RW uint32_t IO0IntEnR;
  _RW uint32_t IO0IntEnF;
       uint32_t RESERVED0[3];
  _R  uint32_t IO2IntStatR;
  _R  uint32_t IO2IntStatF;
  _W  uint32_t IO2IntClr;
  _RW uint32_t IO2IntEnR;
  _RW uint32_t IO2IntEnF;
} GPIOINT_TypeDef;

/*------------- Timer (TIM) --------------------------------------------------*/
/** \brief Timer (TIM) register structure definition */
typedef struct
{
  _RW uint32_t IR;
  _RW uint32_t TCR;
  _RW uint32_t TC;
  _RW uint32_t PR;
  _RW uint32_t PC;
  _RW uint32_t MCR;
  _RW uint32_t MR0;
  _RW uint32_t MR1;
  _RW uint32_t MR2;
  _RW uint32_t MR3;
  _RW uint32_t CCR;
  _R  uint32_t CR0;
  _R  uint32_t CR1;
       uint32_t RESERVED0[2];
  _RW uint32_t EMR;
       uint32_t RESERVED1[12];
  _RW uint32_t CTCR;
} TIM_TypeDef;

/*------------- Pulse-Width Modulation (PWM) ---------------------------------*/
/** \brief Pulse-Width Modulation (PWM) register structure definition */
typedef struct
{
  _RW uint32_t IR;
  _RW uint32_t TCR;
  _RW uint32_t TC;
  _RW uint32_t PR;
  _RW uint32_t PC;
  _RW uint32_t MCR;
  _RW uint32_t MR0;
  _RW uint32_t MR1;
  _RW uint32_t MR2;
  _RW uint32_t MR3;
  _RW uint32_t CCR;
  _R  uint32_t CR0;
  _R  uint32_t CR1;
  _R  uint32_t CR2;
  _R  uint32_t CR3;
       uint32_t RESERVED0;
  _RW uint32_t MR4;
  _RW uint32_t MR5;
  _RW uint32_t MR6;
  _RW uint32_t PCR;
  _RW uint32_t LER;
       uint32_t RESERVED1[7];
  _RW uint32_t CTCR;
} PWM_TypeDef;

/*------------- Universal Asynchronous Receiver Transmitter (UART) -----------*/
/** \brief  Universal Asynchronous Receiver Transmitter (UART) register structure definition */
typedef struct
{
  union {
  _R  uint8_t  RBR;
  _W  uint8_t  THR;
  _RW uint8_t  DLL;
       uint32_t RESERVED0;
  };
  union {
  _RW uint8_t  DLM;
  _RW uint32_t IER;
  };
  union {
  _R  uint32_t IIR;
  _W  uint8_t  FCR;
  };
  _RW uint8_t  LCR;
       uint8_t  RESERVED1[7];
  _R  uint8_t  LSR;
       uint8_t  RESERVED2[7];
  _RW uint8_t  SCR;
       uint8_t  RESERVED3[3];
  _RW uint32_t ACR;
  _RW uint8_t  ICR;
       uint8_t  RESERVED4[3];
  _RW uint8_t  FDR;
       uint8_t  RESERVED5[7];
  _RW uint8_t  TER;
} UART_TypeDef;

/** \brief  Universal Asynchronous Receiver Transmitter 1 (UART1) register structure definition */
typedef struct
{
  union {
  _R  uint8_t  RBR;
  _W  uint8_t  THR;
  _RW uint8_t  DLL;
       uint32_t RESERVED0;
  };
  union {
  _RW uint8_t  DLM;
  _RW uint32_t IER;
  };
  union {
  _R  uint32_t IIR;
  _W  uint8_t  FCR;
  };
  _RW uint8_t  LCR;
       uint8_t  RESERVED1[3];
  _RW uint8_t  MCR;
       uint8_t  RESERVED2[3];
  _R  uint8_t  LSR;
       uint8_t  RESERVED3[3];
  _R  uint8_t  MSR;
       uint8_t  RESERVED4[3];
  _RW uint8_t  SCR;
       uint8_t  RESERVED5[3];
  _RW uint32_t ACR;
       uint32_t RESERVED6;
  _RW uint32_t FDR;
       uint32_t RESERVED7;
  _RW uint8_t  TER;
       uint8_t  RESERVED8[27];
  _RW uint8_t  RS485CTRL;
       uint8_t  RESERVED9[3];
  _RW uint8_t  ADRMATCH;
       uint8_t  RESERVED10[3];
  _RW uint8_t  RS485DLY;
} UART1_TypeDef;

/*------------- Serial Peripheral Interface (SPI) ----------------------------*/
/** \brief  Serial Peripheral Interface (SPI) register structure definition */
typedef struct
{
  _RW uint32_t SPCR;
  _R  uint32_t SPSR;
  _RW uint32_t SPDR;
  _RW uint32_t SPCCR;
       uint32_t RESERVED0[3];
  _RW uint32_t SPINT;
} SPI_TypeDef;

/*------------- Synchronous Serial Communication (SSP) -----------------------*/
/** \brief  Synchronous Serial Communication (SSP) register structure definition */
typedef struct
{
  _RW uint32_t CR0;
  _RW uint32_t CR1;
  _RW uint32_t DR;
  _R  uint32_t SR;
  _RW uint32_t CPSR;
  _RW uint32_t IMSC;
  _RW uint32_t RIS;
  _RW uint32_t MIS;
  _RW uint32_t ICR;
  _RW uint32_t DMACR;
} SSP_TypeDef;

/*------------- Inter-Integrated Circuit (I2C) -------------------------------*/
/** \brief  Inter-Integrated Circuit (I2C) register structure definition */
typedef struct
{
  _RW uint32_t I2CONSET;
  _R  uint32_t I2STAT;
  _RW uint32_t I2DAT;
  _RW uint32_t I2ADR0;
  _RW uint32_t I2SCLH;
  _RW uint32_t I2SCLL;
  _W  uint32_t I2CONCLR;
  _RW uint32_t MMCTRL;
  _RW uint32_t I2ADR1;
  _RW uint32_t I2ADR2;
  _RW uint32_t I2ADR3;
  _R  uint32_t I2DATA_BUFFER;
  _RW uint32_t I2MASK0;
  _RW uint32_t I2MASK1;
  _RW uint32_t I2MASK2;
  _RW uint32_t I2MASK3;
} I2C_TypeDef;

/*------------- Inter IC Sound (I2S) -----------------------------------------*/
/** \brief  Inter IC Sound (I2S) register structure definition */
typedef struct
{
  _RW uint32_t I2SDAO;
  _RW uint32_t I2SDAI;
  _W  uint32_t I2STXFIFO;
  _R  uint32_t I2SRXFIFO;
  _R  uint32_t I2SSTATE;
  _RW uint32_t I2SDMA1;
  _RW uint32_t I2SDMA2;
  _RW uint32_t I2SIRQ;
  _RW uint32_t I2STXRATE;
  _RW uint32_t I2SRXRATE;
  _RW uint32_t I2STXBITRATE;
  _RW uint32_t I2SRXBITRATE;
  _RW uint32_t I2STXMODE;
  _RW uint32_t I2SRXMODE;
} I2S_TypeDef;

/*------------- Repetitive Interrupt Timer (RIT) -----------------------------*/
/** \brief  Repetitive Interrupt Timer (RIT) register structure definition */
typedef struct
{
  _RW uint32_t RICOMPVAL;
  _RW uint32_t RIMASK;
  _RW uint8_t  RICTRL;
       uint8_t  RESERVED0[3];
  _RW uint32_t RICOUNTER;
} RIT_TypeDef;

/*------------- Real-Time Clock (RTC) ----------------------------------------*/
/** \brief  Real-Time Clock (RTC) register structure definition */
typedef struct
{
  _RW uint8_t  ILR;
       uint8_t  RESERVED0[7];
  _RW uint8_t  CCR;
       uint8_t  RESERVED1[3];
  _RW uint8_t  CIIR;
       uint8_t  RESERVED2[3];
  _RW uint8_t  AMR;
       uint8_t  RESERVED3[3];
  _R  uint32_t CTIME0;
  _R  uint32_t CTIME1;
  _R  uint32_t CTIME2;
  _RW uint8_t  SEC;
       uint8_t  RESERVED4[3];
  _RW uint8_t  MIN;
       uint8_t  RESERVED5[3];
  _RW uint8_t  HOUR;
       uint8_t  RESERVED6[3];
  _RW uint8_t  DOM;
       uint8_t  RESERVED7[3];
  _RW uint8_t  DOW;
       uint8_t  RESERVED8[3];
  _RW uint16_t DOY;
       uint16_t RESERVED9;
  _RW uint8_t  MONTH;
       uint8_t  RESERVED10[3];
  _RW uint16_t YEAR;
       uint16_t RESERVED11;
  _RW uint32_t CALIBRATION;
  _RW uint32_t GPREG0;
  _RW uint32_t GPREG1;
  _RW uint32_t GPREG2;
  _RW uint32_t GPREG3;
  _RW uint32_t GPREG4;
  _RW uint8_t  RTC_AUXEN;
       uint8_t  RESERVED12[3];
  _RW uint8_t  RTC_AUX;
       uint8_t  RESERVED13[3];
  _RW uint8_t  ALSEC;
       uint8_t  RESERVED14[3];
  _RW uint8_t  ALMIN;
       uint8_t  RESERVED15[3];
  _RW uint8_t  ALHOUR;
       uint8_t  RESERVED16[3];
  _RW uint8_t  ALDOM;
       uint8_t  RESERVED17[3];
  _RW uint8_t  ALDOW;
       uint8_t  RESERVED18[3];
  _RW uint16_t ALDOY;
       uint16_t RESERVED19;
  _RW uint8_t  ALMON;
       uint8_t  RESERVED20[3];
  _RW uint16_t ALYEAR;
       uint16_t RESERVED21;
} RTC_TypeDef;

/*------------- Watchdog Timer (WDT) -----------------------------------------*/
/** \brief  Watchdog Timer (WDT) register structure definition */
typedef struct
{
  _RW uint8_t  WDMOD;
       uint8_t  RESERVED0[3];
  _RW uint32_t WDTC;
  _W  uint8_t  WDFEED;
       uint8_t  RESERVED1[3];
  _R  uint32_t WDTV;
  _RW uint32_t WDCLKSEL;
} WDT_TypeDef;

/*------------- Analog-to-Digital Converter (ADC) ----------------------------*/
/** \brief  Analog-to-Digital Converter (ADC) register structure definition */
typedef struct
{
  _RW uint32_t ADCR;
  _RW uint32_t ADGDR;
       uint32_t RESERVED0;
  _RW uint32_t ADINTEN;
  _R  uint32_t ADDR[8];
  _R  uint32_t ADSTAT;
  _RW uint32_t ADTRM;
} ADC_TypeDef;

/*------------- Digital-to-Analog Converter (DAC) ----------------------------*/
/** \brief  Digital-to-Analog Converter (DAC) register structure definition */
typedef struct
{
  _RW uint32_t DACR;
  _RW uint32_t DACCTRL;
  _RW uint16_t DACCNTVAL;
} DAC_TypeDef;

/*------------- Motor Control Pulse-Width Modulation (MCPWM) -----------------*/
/** \brief  Motor Control Pulse-Width Modulation (MCPWM) register structure definition */
typedef struct
{
  _R  uint32_t MCCON;
  _W  uint32_t MCCON_SET;
  _W  uint32_t MCCON_CLR;
  _R  uint32_t MCCAPCON;
  _W  uint32_t MCCAPCON_SET;
  _W  uint32_t MCCAPCON_CLR;
  _RW uint32_t MCTIM0;
  _RW uint32_t MCTIM1;
  _RW uint32_t MCTIM2;
  _RW uint32_t MCPER0;
  _RW uint32_t MCPER1;
  _RW uint32_t MCPER2;
  _RW uint32_t MCPW0;
  _RW uint32_t MCPW1;
  _RW uint32_t MCPW2;
  _RW uint32_t MCDEADTIME;
  _RW uint32_t MCCCP;
  _RW uint32_t MCCR0;
  _RW uint32_t MCCR1;
  _RW uint32_t MCCR2;
  _R  uint32_t MCINTEN;
  _W  uint32_t MCINTEN_SET;
  _W  uint32_t MCINTEN_CLR;
  _R  uint32_t MCCNTCON;
  _W  uint32_t MCCNTCON_SET;
  _W  uint32_t MCCNTCON_CLR;
  _R  uint32_t MCINTFLAG;
  _W  uint32_t MCINTFLAG_SET;
  _W  uint32_t MCINTFLAG_CLR;
  _W  uint32_t MCCAP_CLR;
} MCPWM_TypeDef;

/*------------- Quadrature Encoder Interface (QEI) ---------------------------*/
/** \brief  Quadrature Encoder Interface (QEI) register structure definition */
typedef struct
{
  _W  uint32_t QEICON;
  _R  uint32_t QEISTAT;
  _RW uint32_t QEICONF;
  _R  uint32_t QEIPOS;
  _RW uint32_t QEIMAXPOS;
  _RW uint32_t CMPOS0;
  _RW uint32_t CMPOS1;
  _RW uint32_t CMPOS2;
  _R  uint32_t INXCNT;
  _RW uint32_t INXCMP;
  _RW uint32_t QEILOAD;
  _R  uint32_t QEITIME;
  _R  uint32_t QEIVEL;
  _R  uint32_t QEICAP;
  _RW uint32_t VELCOMP;
  _RW uint32_t FILTER;
       uint32_t RESERVED0[998];
  _W  uint32_t QEIIEC;
  _W  uint32_t QEIIES;
  _R  uint32_t QEIINTSTAT;
  _R  uint32_t QEIIE;
  _W  uint32_t QEICLR;
  _W  uint32_t QEISET;
} QEI_TypeDef;

/*------------- Controller Area Network (CAN) --------------------------------*/
/** \brief  Controller Area Network Acceptance Filter RAM (CANAF_RAM)structure definition */
typedef struct
{
  _RW uint32_t mask[512];              /* ID Masks                           */
} CANAF_RAM_TypeDef;

/** \brief  Controller Area Network Acceptance Filter(CANAF) register structure definition */
typedef struct                          /* Acceptance Filter Registers        */
{
  _RW uint32_t AFMR;
  _RW uint32_t SFF_sa;
  _RW uint32_t SFF_GRP_sa;
  _RW uint32_t EFF_sa;
  _RW uint32_t EFF_GRP_sa;
  _RW uint32_t ENDofTable;
  _R  uint32_t LUTerrAd;
  _R  uint32_t LUTerr;
  _RW uint32_t FCANIE;
  _RW uint32_t FCANIC0;
  _RW uint32_t FCANIC1;
} CANAF_TypeDef;

