suyashjunnarkar/self_balancing/firmware/epcf_project/pcf/include/private/arch/arm/cm3/nxp/lpc1768/lpc1768_regmap.h
/** \brief  Controller Area Network Central (CANCR) register structure definition */
typedef struct                          /* Central Registers                  */
{
  _R  uint32_t CANTxSR;
  _R  uint32_t CANRxSR;
  _R  uint32_t CANMSR;
} CANCR_TypeDef;

/** \brief  Controller Area Network Controller (CAN) register structure definition */
typedef struct                          /* Controller Registers               */
{
  _RW uint32_t MOD;
  _W  uint32_t CMR;
  _RW uint32_t GSR;
  _R  uint32_t ICR;
  _RW uint32_t IER;
  _RW uint32_t BTR;
  _RW uint32_t EWL;
  _R  uint32_t SR;
  _RW uint32_t RFS;
  _RW uint32_t RID;
  _RW uint32_t RDA;
  _RW uint32_t RDB;
  _RW uint32_t TFI1;
  _RW uint32_t TID1;
  _RW uint32_t TDA1;
  _RW uint32_t TDB1;
  _RW uint32_t TFI2;
  _RW uint32_t TID2;
  _RW uint32_t TDA2;
  _RW uint32_t TDB2;
  _RW uint32_t TFI3;
  _RW uint32_t TID3;
  _RW uint32_t TDA3;
  _RW uint32_t TDB3;
} CAN_TypeDef;

/*------------- General Purpose Direct Memory Access (GPDMA) -----------------*/
/** \brief  General Purpose Direct Memory Access (GPDMA) register structure definition */
typedef struct                          /* Common Registers                   */
{
  _R  uint32_t DMACIntStat;
  _R  uint32_t DMACIntTCStat;
  _W  uint32_t DMACIntTCClear;
  _R  uint32_t DMACIntErrStat;
  _W  uint32_t DMACIntErrClr;
  _R  uint32_t DMACRawIntTCStat;
  _R  uint32_t DMACRawIntErrStat;
  _R  uint32_t DMACEnbldChns;
  _RW uint32_t DMACSoftBReq;
  _RW uint32_t DMACSoftSReq;
  _RW uint32_t DMACSoftLBReq;
  _RW uint32_t DMACSoftLSReq;
  _RW uint32_t DMACConfig;
  _RW uint32_t DMACSync;
} GPDMA_TypeDef;

/** \brief  General Purpose Direct Memory Access Channel (GPDMACH) register structure definition */
typedef struct                          /* Channel Registers                  */
{
  _RW uint32_t DMACCSrcAddr;
  _RW uint32_t DMACCDestAddr;
  _RW uint32_t DMACCLLI;
  _RW uint32_t DMACCControl;
  _RW uint32_t DMACCConfig;
} GPDMACH_TypeDef;

/*------------- Universal Serial Bus (USB) -----------------------------------*/
/** \brief  Universal Serial Bus (USB) register structure definition */
typedef struct
{
  _R  uint32_t HcRevision;             /* USB Host Registers                 */
  _RW uint32_t HcControl;
  _RW uint32_t HcCommandStatus;
  _RW uint32_t HcInterruptStatus;
  _RW uint32_t HcInterruptEnable;
  _RW uint32_t HcInterruptDisable;
  _RW uint32_t HcHCCA;
  _R  uint32_t HcPeriodCurrentED;
  _RW uint32_t HcControlHeadED;
  _RW uint32_t HcControlCurrentED;
  _RW uint32_t HcBulkHeadED;
  _RW uint32_t HcBulkCurrentED;
  _R  uint32_t HcDoneHead;
  _RW uint32_t HcFmInterval;
  _R  uint32_t HcFmRemaining;
  _R  uint32_t HcFmNumber;
  _RW uint32_t HcPeriodicStart;
  _RW uint32_t HcLSTreshold;
  _RW uint32_t HcRhDescriptorA;
  _RW uint32_t HcRhDescriptorB;
  _RW uint32_t HcRhStatus;
  _RW uint32_t HcRhPortStatus1;
  _RW uint32_t HcRhPortStatus2;
       uint32_t RESERVED0[40];
  _R  uint32_t Module_ID;

  _R  uint32_t OTGIntSt;               /* USB On-The-Go Registers            */
  _RW uint32_t OTGIntEn;
  _W  uint32_t OTGIntSet;
  _W  uint32_t OTGIntClr;
  _RW uint32_t OTGStCtrl;
  _RW uint32_t OTGTmr;
       uint32_t RESERVED1[58];

  _R  uint32_t USBDevIntSt;            /* USB Device Interrupt Registers     */
  _RW uint32_t USBDevIntEn;
  _W  uint32_t USBDevIntClr;
  _W  uint32_t USBDevIntSet;

  _W  uint32_t USBCmdCode;             /* USB Device SIE Command Registers   */
  _R  uint32_t USBCmdData;

  _R  uint32_t USBRxData;              /* USB Device Transfer Registers      */
  _W  uint32_t USBTxData;
  _R  uint32_t USBRxPLen;
  _W  uint32_t USBTxPLen;
  _RW uint32_t USBCtrl;
  _W  uint32_t USBDevIntPri;

  _R  uint32_t USBEpIntSt;             /* USB Device Endpoint Interrupt Regs */
  _RW uint32_t USBEpIntEn;
  _W  uint32_t USBEpIntClr;
  _W  uint32_t USBEpIntSet;
  _W  uint32_t USBEpIntPri;

  _RW uint32_t USBReEp;                /* USB Device Endpoint Realization Reg*/
  _W  uint32_t USBEpInd;
  _RW uint32_t USBMaxPSize;

  _R  uint32_t USBDMARSt;              /* USB Device DMA Registers           */
  _W  uint32_t USBDMARClr;
  _W  uint32_t USBDMARSet;
       uint32_t RESERVED2[9];
  _RW uint32_t USBUDCAH;
  _R  uint32_t USBEpDMASt;
  _W  uint32_t USBEpDMAEn;
  _W  uint32_t USBEpDMADis;
  _R  uint32_t USBDMAIntSt;
  _RW uint32_t USBDMAIntEn;
       uint32_t RESERVED3[2];
  _R  uint32_t USBEoTIntSt;
  _W  uint32_t USBEoTIntClr;
  _W  uint32_t USBEoTIntSet;
  _R  uint32_t USBNDDRIntSt;
  _W  uint32_t USBNDDRIntClr;
  _W  uint32_t USBNDDRIntSet;
  _R  uint32_t USBSysErrIntSt;
  _W  uint32_t USBSysErrIntClr;
  _W  uint32_t USBSysErrIntSet;
       uint32_t RESERVED4[15];

  union {
  _R  uint32_t I2C_RX;                 /* USB OTG I2C Registers              */
  _W  uint32_t I2C_TX;
  };
  _R  uint32_t I2C_STS;
  _RW uint32_t I2C_CTL;
  _RW uint32_t I2C_CLKHI;
  _W  uint32_t I2C_CLKLO;
       uint32_t RESERVED5[824];

  union {
  _RW uint32_t USBClkCtrl;             /* USB Clock Control Registers        */
  _RW uint32_t OTGClkCtrl;
  };
  union {
  _R  uint32_t USBClkSt;
  _R  uint32_t OTGClkSt;
  };
} USB_TypeDef;

/*------------- Ethernet Media Access Controller (EMAC) ----------------------*/
/** \brief  Ethernet Media Access Controller (EMAC) register structure definition */
typedef struct
{
  _RW uint32_t MAC1;                   /* MAC Registers                      */
  _RW uint32_t MAC2;
  _RW uint32_t IPGT;
  _RW uint32_t IPGR;
  _RW uint32_t CLRT;
  _RW uint32_t MAXF;
  _RW uint32_t SUPP;
  _RW uint32_t TEST;
  _RW uint32_t MCFG;
  _RW uint32_t MCMD;
  _RW uint32_t MADR;
  _W  uint32_t MWTD;
  _R  uint32_t MRDD;
  _R  uint32_t MIND;
       uint32_t RESERVED0[2];
  _RW uint32_t SA0;
  _RW uint32_t SA1;
  _RW uint32_t SA2;
       uint32_t RESERVED1[45];
  _RW uint32_t Command;                /* Control Registers                  */
  _R  uint32_t Status;
  _RW uint32_t RxDescriptor;
  _RW uint32_t RxStatus;
  _RW uint32_t RxDescriptorNumber;
  _R  uint32_t RxProduceIndex;
  _RW uint32_t RxConsumeIndex;
  _RW uint32_t TxDescriptor;
  _RW uint32_t TxStatus;
  _RW uint32_t TxDescriptorNumber;
  _RW uint32_t TxProduceIndex;
  _R  uint32_t TxConsumeIndex;
       uint32_t RESERVED2[10];
  _R  uint32_t TSV0;
  _R  uint32_t TSV1;
  _R  uint32_t RSV;
       uint32_t RESERVED3[3];
  _RW uint32_t FlowControlCounter;
  _R  uint32_t FlowControlStatus;
       uint32_t RESERVED4[34];
  _RW uint32_t RxFilterCtrl;           /* Rx Filter Registers                */
  _RW uint32_t RxFilterWoLStatus;
  _RW uint32_t RxFilterWoLClear;
       uint32_t RESERVED5;
  _RW uint32_t HashFilterL;
  _RW uint32_t HashFilterH;
       uint32_t RESERVED6[882];
  _R  uint32_t IntStatus;              /* Module Control Registers           */
  _RW uint32_t IntEnable;
  _W  uint32_t IntClear;
  _W  uint32_t IntSet;
       uint32_t RESERVED7;
  _RW uint32_t PowerDown;
       uint32_t RESERVED8;
  _RW uint32_t Module_ID;
} EMAC_TypeDef;



/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define FLASH_BASE        (0x00000000UL)
#define RAM_BASE          (0x10000000UL)
#ifdef __LPC17XX_REV00
#define AHBRAM0_BASE      (0x20000000UL)
#define AHBRAM1_BASE      (0x20004000UL)
#else
#define AHBRAM0_BASE      (0x2007C000UL)
#define AHBRAM1_BASE      (0x20080000UL)
#endif
#define GPIO_BASE         (0x2009C000UL)
#define APB0_BASE         (0x40000000UL)
#define APB1_BASE         (0x40080000UL)
#define AHB_BASE          (0x50000000UL)
#define CM3_BASE          (0xE0000000UL)

/* APB0 peripherals                                                           */
#define WDT_BASE          (APB0_BASE + 0x00000)
#define TIM0_BASE         (APB0_BASE + 0x04000)
#define TIM1_BASE         (APB0_BASE + 0x08000)
#define UART0_BASE        (APB0_BASE + 0x0C000)
#define UART1_BASE        (APB0_BASE + 0x10000)
#define PWM1_BASE         (APB0_BASE + 0x18000)
#define I2C0_BASE         (APB0_BASE + 0x1C000)
#define SPI_BASE          (APB0_BASE + 0x20000)
#define RTC_BASE          (APB0_BASE + 0x24000)
#define GPIOINT_BASE      (APB0_BASE + 0x28080)
#define PINCON_BASE       (APB0_BASE + 0x2C000)
#define SSP1_BASE         (APB0_BASE + 0x30000)
#define ADC_BASE          (APB0_BASE + 0x34000)
#define CANAF_RAM_BASE    (APB0_BASE + 0x38000)
#define CANAF_BASE        (APB0_BASE + 0x3C000)
#define CANCR_BASE        (APB0_BASE + 0x40000)
#define CAN1_BASE         (APB0_BASE + 0x44000)
#define CAN2_BASE         (APB0_BASE + 0x48000)
#define I2C1_BASE         (APB0_BASE + 0x5C000)

/* APB1 peripherals                                                           */
#define SSP0_BASE         (APB1_BASE + 0x08000)
#define DAC_BASE          (APB1_BASE + 0x0C000)
#define TIM2_BASE         (APB1_BASE + 0x10000)
#define TIM3_BASE         (APB1_BASE + 0x14000)
#define UART2_BASE        (APB1_BASE + 0x18000)
#define UART3_BASE        (APB1_BASE + 0x1C000)
#define I2C2_BASE         (APB1_BASE + 0x20000)
#define I2S_BASE          (APB1_BASE + 0x28000)
#define RIT_BASE          (APB1_BASE + 0x30000)
#define MCPWM_BASE        (APB1_BASE + 0x38000)
#define QEI_BASE          (APB1_BASE + 0x3C000)
#define SC_BASE           (APB1_BASE + 0x7C000)

/* AHB peripherals                                                            */
#define EMAC_BASE         (AHB_BASE  + 0x00000)
#define GPDMA_BASE        (AHB_BASE  + 0x04000)
#define GPDMACH0_BASE     (AHB_BASE  + 0x04100)
#define GPDMACH1_BASE     (AHB_BASE  + 0x04120)
#define GPDMACH2_BASE     (AHB_BASE  + 0x04140)
#define GPDMACH3_BASE     (AHB_BASE  + 0x04160)
#define GPDMACH4_BASE     (AHB_BASE  + 0x04180)
#define GPDMACH5_BASE     (AHB_BASE  + 0x041A0)
#define GPDMACH6_BASE     (AHB_BASE  + 0x041C0)
#define GPDMACH7_BASE     (AHB_BASE  + 0x041E0)
#define USB_BASE          (AHB_BASE  + 0x0C000)

/* GPIOs                                                                      */
#define GPIO0_BASE        (GPIO_BASE + 0x00000)
#define GPIO1_BASE        (GPIO_BASE + 0x00020)
#define GPIO2_BASE        (GPIO_BASE + 0x00040)
#define GPIO3_BASE        (GPIO_BASE + 0x00060)
#define GPIO4_BASE        (GPIO_BASE + 0x00080)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define PERIPH_SC                ((SC_TypeDef        *) SC_BASE       )
#define PERIPH_GPIO0             ((GPIO_TypeDef      *) GPIO0_BASE    )
#define PERIPH_GPIO1             ((GPIO_TypeDef      *) GPIO1_BASE    )
#define PERIPH_GPIO2             ((GPIO_TypeDef      *) GPIO2_BASE    )
#define PERIPH_GPIO3             ((GPIO_TypeDef      *) GPIO3_BASE    )
#define PERIPH_GPIO4             ((GPIO_TypeDef      *) GPIO4_BASE    )
#define PERIPH_WDT               ((WDT_TypeDef       *) WDT_BASE      )
#define PERIPH_TIMER0            ((TIM_TypeDef       *) TIM0_BASE     )
#define PERIPH_TIMER1            ((TIM_TypeDef       *) TIM1_BASE     )
#define PERIPH_TIMER2            ((TIM_TypeDef       *) TIM2_BASE     )
#define PERIPH_TIMER3            ((TIM_TypeDef       *) TIM3_BASE     )
#define PERIPH_RIT               ((RIT_TypeDef       *) RIT_BASE      )
#define PERIPH_UART0             ((UART_TypeDef      *) UART0_BASE    )
#define PERIPH_UART1             ((UART1_TypeDef     *) UART1_BASE    )
#define PERIPH_UART2             ((UART_TypeDef      *) UART2_BASE    )
#define PERIPH_UART3             ((UART_TypeDef      *) UART3_BASE    )
#define PERIPH_PWM1              ((PWM_TypeDef       *) PWM1_BASE     )
#define PERIPH_I2C0              ((I2C_TypeDef       *) I2C0_BASE     )
#define PERIPH_I2C1              ((I2C_TypeDef       *) I2C1_BASE     )
#define PERIPH_I2C2              ((I2C_TypeDef       *) I2C2_BASE     )
#define PERIPH_I2S               ((I2S_TypeDef       *) I2S_BASE      )
#define PERIPH_SPI               ((SPI_TypeDef       *) SPI_BASE      )
#define PERIPH_RTC               ((RTC_TypeDef       *) RTC_BASE      )
#define PERIPH_GPIOINT           ((GPIOINT_TypeDef   *) GPIOINT_BASE  )
#define PERIPH_PINCON            ((PINCON_TypeDef    *) PINCON_BASE   )
#define PERIPH_SSP0              ((SSP_TypeDef       *) SSP0_BASE     )
#define PERIPH_SSP1              ((SSP_TypeDef       *) SSP1_BASE     )
#define PERIPH_ADC               ((ADC_TypeDef       *) ADC_BASE      )
#define PERIPH_DAC               ((DAC_TypeDef       *) DAC_BASE      )
#define PERIPH_CANAF_RAM         ((CANAF_RAM_TypeDef *) CANAF_RAM_BASE)
#define PERIPH_CANAF             ((CANAF_TypeDef     *) CANAF_BASE    )
#define PERIPH_CANCR             ((CANCR_TypeDef     *) CANCR_BASE    )
#define PERIPH_CAN1              ((CAN_TypeDef       *) CAN1_BASE     )
#define PERIPH_CAN2              ((CAN_TypeDef       *) CAN2_BASE     )
#define PERIPH_MCPWM             ((MCPWM_TypeDef     *) MCPWM_BASE    )
#define PERIPH_QEI               ((QEI_TypeDef       *) QEI_BASE      )
#define PERIPH_EMAC              ((EMAC_TypeDef      *) EMAC_BASE     )
#define PERIPH_GPDMA             ((GPDMA_TypeDef     *) GPDMA_BASE    )
#define PERIPH_GPDMACH0          ((GPDMACH_TypeDef   *) GPDMACH0_BASE )
#define PERIPH_GPDMACH1          ((GPDMACH_TypeDef   *) GPDMACH1_BASE )
#define PERIPH_GPDMACH2          ((GPDMACH_TypeDef   *) GPDMACH2_BASE )
#define PERIPH_GPDMACH3          ((GPDMACH_TypeDef   *) GPDMACH3_BASE )
#define PERIPH_GPDMACH4          ((GPDMACH_TypeDef   *) GPDMACH4_BASE )
#define PERIPH_GPDMACH5          ((GPDMACH_TypeDef   *) GPDMACH5_BASE )
#define PERIPH_GPDMACH6          ((GPDMACH_TypeDef   *) GPDMACH6_BASE )
#define PERIPH_GPDMACH7          ((GPDMACH_TypeDef   *) GPDMACH7_BASE )
#define PERIPH_USB               ((USB_TypeDef       *) USB_BASE      )


/** GPIO Port 0 Register addresses.		*/
/** These addresses are used as base addresses and port-wise offset will be added to for each port operation.	*/
#define GPIO_IODIR_BASE				0x2009C000
#define GPIO_MASK_BASE				0x2009C010
#define GPIO_PIN_BASE				0x2009C014
#define GPIO_SET_BASE				0x2009C018
#define GPIO_CLEAR_BASE				0x2009C01C

/** @} */
#endif	// __PCF_INCLUDE_PRIVATE_ARCH_ARM_CM3_NXP_LPC1768_LPC1768_REGMAP_H
